

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Fine Art by Kneecap
Fine Art
Kneecap
Producer
Toddla T
Track 2 on
Fine Art 
Mar. 27, 2024
1 viewer
28K views




13 Contributors
Fine Art Lyrics
Éist liom, ná tar chugam le do chuid smaointí
Ná déan anailís ar mo chuid líntí
My child loves HOOD so I wish you would do a version for him, but PG
Send me it when you can, he’s your number one fan
His first word’s were Cultúrlann so he understands all of 3CAG and
He only started Naíscoil an mhí seo, he just thinks you guys are lethal
I know he’s a wee bit young, try to keep it from him, déanaimse mo dhícheall
Comhghairdeas your my new ghost writer, 40 odd, breath smells like cider
Trying to talk business to me with jizz on your teeth, back of the glider!

KNEECAP, is breá liom sibh, nach bhfuil aon seans go dtiocfadh libh
Stick a wee tune out just for the kids cos my two ones they love you to bits
Oh fuck sake, wise up miss, wе’re degenеrate HOODs who like to get pissed
And we spunk every penny getting off of our tits, this isn’t no act, it’s just the way it is, real shit

You’ll find me in a snug of a dimly lit shit run down pub
Face all smug in a place I love, seeing how fucked I can get on government funds
That’s another pint done, ordaigh deoch sula labhrann cunt liom
And up walks some random standing over me rapping one of my songs

Maith an fear, seo here, is breá liom do cheol, nach dtiocfadh leat díriú isteach ar an ól
An chaint seo ar fad ar na drugaí are bad, is tá mé a rá leat ní mharfaidh tú i bhfad
Aw here go raibh maith agat do do chomhairle críonna
Cá raibh tusa nuair a thosaigh muid na blianta ó shin
No fuck, get a right to the chin and now you’re crying on twitter and that’s a win win
See Kneecap Live
Get tickets as low as $81

You might also like
I bhFiacha Linne
Kneecap
H.O.O.D
Kneecap
3CAG
Kneecap
[Male Reporter]
On the Nolan show today a mural of a burning police car and chants of get the brits out
This is Ireland 2022 rappers Kneecap say the mural was unveiled as just a piece of FINE ART

C-E-A-R-T-A, you say it needs more Tiocfaidh ár Lá’s
Ag dul ar aghaidh faoi go bhfuil easpa collabs ag Kneecap, fuckin cuirigí ceol amach!
So you’re wondering why we take ages to release music? We’re always on stages
All over in different places, rockin balaclavas on our faces

You can love us or hate us, won’t affect a bit of our wages
More merch, more drugs, less cops, more thugs, more scum, listen out on cases
You can love us or hate us, won’t affect a bit of our wages
More merch, more drugs, less cops, more thugs, more scum, more FINE ART



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
Is there a live performance of "Fine Art" by Kneecap?

Genius Answer
1 contributor

+9
Who produced “Fine Art” by Kneecap?

When did Kneecap release “Fine Art”?

Who wrote “Fine Art” by Kneecap?

Fine Art (2024)
Kneecap
1.
3CAG
2.
Fine Art
3.
I bhFiacha Linne
4.
I’m Flush
5.
Better Way to Live
6.
Sick In The Head
7.
Love Making
8.
Drug Dealin Pagans
9.
Harrow Road
10.
Parful
11.
Rhino Ket
12.
Way Too Much
Expand 
Credits
Producer
Toddla T
Writers
James John O’Dochartaigh, Liam Óg Ó Hannaidh, Naoise Iarla Ó CaireallÁin & Toddla T
Released on
March 27, 2024
Tags
Rap
Gaeilge
Irish Rap
Ireland
Expand 
Comments
Add a comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Investors with €500k or more, get our guide and ongoing insights to learn ways to grow your wealth from your portfolio.
(Fisher Investments Ireland)
The most realistic game 2025. If you own a mouse, play it for 1 minute.FROM THE WEB
The most realistic game 2025. If you own a mouse, play it for 1 minute.
Play for free. No Installation.
(Combat Siege)
Tim Curry: rare public appearance sparks concern among fansFROM THE WEB
Tim Curry: rare public appearance sparks concern among fans
(Ohmymag)
FROM THE WEB
11 Retirement Blunders to Avoid Once Your Portfolio Reaches €350,000
(Fisher Investments Ireland)
Liam Payne's father had warned that the singer should never be left aloneFROM THE WEB
Liam Payne's father had warned that the singer should never be left alone
(NEWS/OhMyMag.co.uk)
Drink 1 Cup Every Morning – See What Happens A Week Later!FROM THE WEB
Drink 1 Cup Every Morning – See What Happens A Week Later!
(Health Watcher)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
HUNTR/X - Golden (Romanized)
Animals (Pt. I)
Free
What It Sounds Like
How It’s Done
View All
