

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Love Making by Kneecap
Love Making
Kneecap
Track 7 on
Fine Art 
Jun. 14, 2024
1 viewer
5.9K views




5 Contributors

Translations
Love Making Lyrics
[Chorus]
You know, I know I’m the one your gonna be taking
From your show to your home, me and you lets be love making
Your hands do enough, it’s all about the way we’re syncing up, oh oh, oh oh

[Verse]
Ní amháin gnéas ach craic, lets make a mess and relax
Cos we’ve got vibes in stacks, local snacks and hotel sacks
Féiltí, béiltí, filthy texts, chillin listening to silky tracks
Damhsa, bouncing in packs, tinneas poit, toit and we’re back
Ar shiúl linn go háit lán daoine, cúpla stout a few martinis
Is tá tú ar an eolas, laid back flawless, níl leithscéal de dhíth to come see ye
Ar an leathanach céanna, i leabhar difriúil but I wouldn’t change ya
Gan srianta, you’re no saint ach níl mé féin ach an oiread, sinner le blianta

Faoi do gheasa, ag titim i ngrá giota beag róghasta
An duinе deireanach i gcónaí ag an afters
Piolla ina lámh shе knows gan dabht we’re gonna go halfers
Fiáin chan classy, is ar éigean go bhfágaimid an leabaidh
Tuigeann sí go maith go bhfuair mé mo sháith de na quantity birds
Seo bean ar leith

[Chorus]
You know, I know I’m the one your gonna be taking
From your show to your home, me and you lets be love making
Your hands do enough, it’s all about the way we’re syncing up, oh oh, oh oh
See Kneecap Live
Get tickets as low as $81

You might also like
Better Way to Live
Kneecap
Fine Art
Kneecap
Sick In The Head
Kneecap
[Verse]
Aimsir go dona lasmuigh so it’s tine lasta ag freastal uirthi
She’s a rascal indeed and it’s class all for me
Then she laughs said she’s sponsored a rapper in need
Réchúiseach, fuinneamh calm, beo sa bhomaite buíoch de m’am
Ag fáil cóngarach whenever I can, cos she says I do enough with my hands

Tá mé gafa le do pheromones, I’m grabbin her hair she’s doin mad moans
Pit ó na flaithis agus tóin mhór ramhar, is thiocfadh linn caint go deo faoi aon ábhar
You know I know, we’re trying to take it slow, but I’m onstage looking at the front row
You’re all I see and you’re looking at me, I can see it in your eyes let’s split let’s leave

[Chorus]
You know, I know I’m the one your gonna be taking
From your show to your home, me and you lets be love making
Your hands do enough, it’s all about the way we’re syncing up, oh oh, oh oh



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
When did Kneecap release “Love Making”?

Fine Art (2024)
Kneecap
1.
3CAG
2.
Fine Art
3.
I bhFiacha Linne
4.
I’m Flush
5.
Better Way to Live
6.
Sick In The Head
7.
Love Making
8.
Drug Dealin Pagans
9.
Harrow Road
10.
Parful
11.
Rhino Ket
12.
Way Too Much
Expand 
Credits
Released on
June 14, 2024
Love Making Translations
Kneecap - Love Making (English Translation) by Genius English Translations
Tags
Rap
Irish Rap
Ireland
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Get your copy of the guide and ongoing insights to learn ways to grow your wealth and generate income from your portfolio.
(Fisher Investments Ireland)
You will never turn off your computer again if you have a mouseFROM THE WEB
You will never turn off your computer again if you have a mouse
Play for free. No Installation.
(Combat Siege)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
[Pics] Always Put a Plastic Bottle on Your Tires when Parked, Here's WhyFROM THE WEB
[Pics] Always Put a Plastic Bottle on Your Tires when Parked, Here's Why
(Articlestone)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
KILL
Crocs (Snippet)
Bir Yol
CLS
Free
View All
