

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Sick In The Head by Kneecap
Sick In The Head
Kneecap
Producer
The Tenth Man
Track 6 on
Fine Art 
Feb. 20, 2024
1 viewer
26.8K views




14 Contributors
Sick In The Head Lyrics
Chorus:
I’ve got a point to be proving to myself, sitting too long getting mouldy on the shelf
Cos I’m too far gone when it comes to mental health
Rather be sick in the head with a little bit of wealth
Tá mé tinn de bheith ag glacadh comhairle stráinséara
Mar tá an cinneadh a dhéanann daoine domsa dáinséarach
Ag éirí leadránach, go síoraí ag caint cac’
Níl mé dul a bheith ag éisteacht as seo amach

Seasaigí, tú ar do ghlúine they’re doing it to ya constantly
An individual is surely what ya want to be, you’re born to stand out
Live your fantasy before they eat you up and spit you out and laugh at ye
Fan socair, bí díograiseach is cloígh le do phlean mucker
There’ll be push backs but relax siocair, gur seo do thriailse
Do shaol atá ann brother
It’s a philosophy

Ní ligim don domhan mór riamh dul i bhfeidhm ar an fhíorshaol atá ar an taobh istigh
To be affecting me because cibé rud atá le tarlú is always how it’s meant to be
So goitse, cogar, cloígh leat féin is ná héist le haon fucker
Ní thuigeann siad tusa mar a thuigeann tusa tusa, níor shiúil siad i do chosa
So tóg seans, seans go n-éireoidh sé níos fusa

Chorus:
I’ve got a point to be proving to myself, sitting too long getting mouldy on the shelf
Cos I’m too far gone when it comes to mental health
Rather be sick in the head with a little bit of wealth
Tá mé tinn de bheith ag glacadh comhairle stráinséara
Mar tá an cinneadh a dhéanann daoine domsa dáinséarach
Ag éirí leadránach, go síoraí ag caint cac’
Níl mé dul a bheith ag éisteacht as seo amach
See Kneecap Live
Get tickets as low as $81

You might also like
Your Sniffer Dogs Are Shite
Kneecap
Better Way to Live
Kneecap
H.O.O.D
Kneecap
I prayed to the devil, let me be rich instead, he said
“You’ll no longer be skint but you’ll be sick in the head
Ní bheidh tú riamh sna sráideanna ach agatsa, beidh fadhbanna
You want this for náideanna sa bhreis when you’re paid?”
Yes!

“You’re a mad cunt Mo Chara”

Sound! I’ll be back for a fat loan tomorrow, that’s me never getting dressed
Depressed and always para, throwing tantrums in my mansion, am I embarrassed?
Nah

Gach seans go bhfuil mé giota beag ar mire, níl aon dabht maidir liomsa is Mo Chara
Ar strae insa cheann, when we’re smoking then we’re smoking til it’s all done all gone
No half measures til it’s aw naw
But we’re making up our own laws, never getting worried bout our own flaws
Fuck a real job, we make our own bob, KNEECAP 3CAG we’re our own Gods

Chorus:
I’ve got a point to be proving to myself, sitting too long getting mouldy on the shelf
Cos I’m too far gone when it comes to mental health
Rather be sick in the head with a little bit of wealth
Tá mé tinn de bheith ag glacadh comhairle stráinséara
Mar tá an cinneadh a dhéanann daoine domsa dáinséarach
Ag éirí leadránach, go síoraí ag caint cac’
Níl mé dul a bheith ag éisteacht as seo amach



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
What did Kneecap say about "Sick In The Head"?

Genius Answer
1 contributor
We’re in the centre of a sweaty mosh pit mid-gig in a dark warehouse room. This pit represents emotional state, from f*cked up and chaotic to moments of clarity and calmness. The warehouse offers escape – from the mundane… for the marginalised.

— via Hot Press

+10
Who produced “Sick In The Head” by Kneecap?

When did Kneecap release “Sick In The Head”?

Who wrote “Sick In The Head” by Kneecap?

Fine Art (2024)
Kneecap
1.
3CAG
2.
Fine Art
3.
I bhFiacha Linne
4.
I’m Flush
5.
Better Way to Live
6.
Sick In The Head
7.
Love Making
8.
Drug Dealin Pagans
9.
Harrow Road
10.
Parful
11.
Rhino Ket
12.
Way Too Much
Expand 
Credits
Producer
The Tenth Man
Writers
Móglaí Bap & Mo Chara
Released on
February 20, 2024
Tags
Rap
Irish Rap
Ireland
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
FROM THE WEB
11 Retirement Blunders to Avoid Once Your Portfolio Reaches €350,000
(Fisher Investments Ireland)
Do you have a mouse? Play this game for 1 minuteFROM THE WEB
Do you have a mouse? Play this game for 1 minute
Play for free. No Installation.
(Combat Siege)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Get your copy of the guide and ongoing insights to learn ways to grow your wealth and generate income from your portfolio.
(Fisher Investments Ireland)
Tim Curry spotted in wheelchair in rare public outing - here's how a stroke changed his lifeFROM THE WEB
Tim Curry spotted in wheelchair in rare public outing - here's how a stroke changed his life
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
19 Uhr
KILL
Crocs (Snippet)
Bir Yol
CLS
View All
