

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Fenian Cunts by Kneecap
Fenian Cunts
Kneecap
Producers
David Lievense & Arveene Juthan
Track 1 on
Fenian Cunts - Single 
Sep. 13, 2019
1 viewer
38K views




19 Contributors
Fenian Cunts Lyrics
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me

I stumbled out ag a trí a chlog ar maidin
Dallamullóg uirthi nuair a bhuail mé leis an cailín is deise, milse, i bhfad na cruinne
Cé go rabh cúpla double D's ar mo dhuine, is cinnte gurbh seo mo Niamh Cinn Óir, my future stór
[?]
So dúirt mé ‘den craic Is mise Móglaí Bap
She said that’s a funny name I never heard that word
It’s actually Irish but enough about me ? cén ainm atá ort a tháisce agus dhfreagair sí
Hi my name is Eliza Woodcock
I’m not from around here but I like it a lot
And I was like wait whaa, sin ainm aisteach
Oh yeah bhí mé ag caint le Protastúnach

You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me

Mhúscail mé ar maidín taobh le bean álainn
Bhí mé ar oíche amach ar mo bealach a bhaile
And dúirt mé hello miss my name is Mo Chara
And ansin dúirt sí she had no plans tomorrow
Bean ghleoite, spleodrach, lán de craic nuair a labhair sí ní raibh sí lán de các
Said whatever your name is do you want to come back
Nuair a landáil muid her bedsheets were a Union Jack
Fuck me duairt me internally
Grianghraf do a Deaideo san RUC ar an dresser
I start to undress her
Craic ar dhóigh because she’s a messer, níos moille nuair a thit sí 'na luí, bhí mé síoraí ag smaoineamh faoin Éirí Amach
Sure tá mé sa leabaidh le Protastúnach
See Kneecap Live
Get tickets as low as $81

You might also like
Get Your Brits Out
Kneecap
C.E.A.R.T.A
Kneecap
H.O.O.D
Kneecap
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me

[?] is cuma liom faoi do creideamh
I just wanna know an bhfuil tú ag iarraidh [?] suas Bóthar na bhFál
Maybe we could grab a swall, cúpla canna síos ag an bhalla síochána
Agus bhféidir ina ndiaidh [?] cause baby I’m not just all about the [?]
Ulster Plantations cause gan é we wouldn’t be having relations

Are you a Fenian a dúirt sí liom
You should have told me that before I let ya smack my bum
Ach an oíche ar fad you’re tellin’ me I’m the one
Well I’ve got no time for Republican scum
What the fuck that’s racist or something
You didn’t mind when my face was in your muffin
Stop huffin just mar gheall gurbh as Bóthar na bhFál domh
You can call me King Billy if you want to

You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Oooh
You Fenian Cunts, you Fenian Cunts, you Fenian Cunts, Get away from me



Embed
About
This song bio is unreviewed
Genius Annotation
1 contributor
This song details a night out which ends in the lads in kneecap mo chara agus moglai bap going to bed with a protestant. The song ends with the girl finding out the lads are catholics and not being happy about it whereas the boys don’t care about religion or nationality they just want to get some. The word fenian is a sectarian derogatory term for irish catholics (more specifically republicans) that comes from the fenian brotherhood and the IRB who are irish rebel groups.




Share
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
Who produced “Fenian Cunts” by Kneecap?

When did Kneecap release “Fenian Cunts”?

Who wrote “Fenian Cunts” by Kneecap?

Fenian Cunts - Single (2019)
Kneecap
1.
Fenian Cunts
Credits
Producers
David Lievense & Arveene Juthan
Writers
Móglaí Bap & Mo Chara
Released on
September 13, 2019
Tags
Rap
UK
Northern Ireland
Gaeilge
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
11 Blunders to Avoid to Help You Retire ComfortablyFROM THE WEB
11 Blunders to Avoid to Help You Retire Comfortably
For individuals with a €500k+ portfolio, get our guide and ongoing insights to help plan the retirement you deserve.
(Fisher Investments Ireland)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
FROM THE WEB
When Will You Be Able to Retire?
(Fisher Investments Ireland)
Tim Curry: how a stroke changed everything for the 'It' actorFROM THE WEB
Tim Curry: how a stroke changed everything for the 'It' actor
(Ohmymag)
Do you have a mouse? Play this game for 1 minuteFROM THE WEB
Do you have a mouse? Play this game for 1 minute
Play for free. No Installation.
(Combat Siege)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
Free
HUNTR/X - Golden (Romanized)
Animals (Pt. I)
What It Sounds Like
How It’s Done
View All
