

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Gael-Gigolos by Kneecap
Gael-Gigolos
Kneecap
Producer
DJ PRÓVAÍ
Track 1 on
Gael-Gigolos - Single 
May 31, 2019
1 viewer
31K views




20 Contributors
Gael-Gigolos Lyrics
On behalf of the official Republican movement
I'm here to tell you's, ya have twenty-four hours

Cunts, ag cur amú mo chuid ama
Buachaillí beaga dána
Sa tóir orainn cheana
Tinn tuirseach of fake próvaís
Ach gheobhaidh siad faic uaim agus Móglaí
[Móglaí Bap]
I told ye, nach bí ag dul thar fóir
Agus na bí ag siúl thart clúdaithe in focain óir
Look ní ga a bheith buartha a stór
It’s not like making a few quid was hard before
Bhuel tá sin fíor, ach tá na cunts seo gan ciall
Mar cuirfeadh muid deireadh lena fucking saol, sóisialta
And if you don’t know, I’M NOT TELLING YE MUCKER
Alright then Mo Chara caide an fócain plean
I’m fucking chocking out agus tá muid ag ritheadh amach as am
Agus róimhe bhfad bheadh ár nglúine lan luaidhe
Fuck that tá muid ag bogadh amach faoin tuath
Sure we’re well known for being croí na féile
Just úsáid do cheann agus tiocfaidh plean le cheile
Ag labhairt faoin ceann atá ar do bhod
Mar tá sean folk amuigh ansin ag iarraigh cuid
What are you looking? Gram for thirty, two for fifty
See Kneecap Live
Get tickets as low as $81

You might also like
Amach Anocht
Kneecap
Fenian Cunts
Kneecap
Incognito
Kneecap
Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

We made a mint off the baggies i gConnamara
Bheadh siad ag súil le airgead maidín amárach
Isteach liom ins an local siopa dara láimhe
Then selling clothes on to hipsters at halla na cathrach
Next up ag bualadh isteach ag cupla bean an tí
A locally known gigolo if your husband is deceased
[?]
Mar is sean fear tú tá mé i bhfad níos costasaí

Old Dick? I just lick it and spit
Sean fitch? Mate for airgead I eat that shit
Ach VIT-HIT róimhe agus direach ina ndiaidh
Because hydrated boys can last all day

Codhladh orm I’m kicking up a storm
Le mo buaitaisí ghoirm mar ní bheadh sé tirim
Chead stop chuig an teach altranais
Yes Miss, Twenty extra for a tongue with a kiss
Agus caoga eile I’ll let you slip the fist
Seo an saol anois
Kneecap ar an hit list
Gael-Gigolos, ag freastáil ar na mammy hoes, na daddy hoes
Mar tá mé chomh bocht le mo serotonin
But even seandaoine need to get a boning
Daoine deasa when you get to know them
Na rudaí deasa that could be stolen
‘Nois níl mé ach magadh nuair a deirim é sin
Na cur mo ainm síos for your next of kin
Agus fagadh amach gach pinn do do pinsean
Abair le do chairde about my erection
Massive, Massive
Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

[?]
Tá sé in am duinn, its time to do this
Fágaim slán le mo pensioner mates
Seo cúpla punt sa bhreis and don’t forget to close the gate
Imionn liom chun bualadh le Móglaí
[?]
Sweet, críochnaithe anois amigo
Bucking old people, I’m an opposite pedo
Rockáil suas ag an páirc agus tchím na dissies
Le phus mór orthú
Cause I’m blowing them kissies
Whats happening fellas now don’t be getting jealous
I’ll take you’s all out for a Goodfellas next
'Nois beagnach deánta
Ach tá trup mór callán
Dj Próvaí agus a mhac on a tandem
Caide an craic boys
And he whips out his handgun
Sin an deireadh leis na RA men
Sin an deireadh leis na RA men
Níl an fáilte roimh an tandem
You looking yokes cause I have them
You looking yokes cause I have them

Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

Na cunts, ag cur amú mo chuid ama
Na blunts, níl faic i mo mhála
Na funds, tá seo ag iarraidh cásta
Ach ar an laghad tá do mhamó sásta

Maggie from the Upper Falls what’s happening
Shout out to dirty Deirdre from Divis
Tá a fhios agaibh an craic
Any age, any sex
Riding old folk from any postcode
Cross community



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
Who produced “Gael-Gigolos” by Kneecap?

When did Kneecap release “Gael-Gigolos”?

Who wrote “Gael-Gigolos” by Kneecap?

Gael-Gigolos - Single (2019)
Kneecap
1.
Gael-Gigolos
Credits
Producer
DJ PRÓVAÍ
Writers
Mo Chara & Móglaí Bap
Mixing Engineer
Ciarán Byrne
Mastering Engineer
Ciarán Byrne
Speaking Voice
DJ PRÓVAÍ
Engineer
Chris Fitzpatrick
Released on
May 31, 2019
Tags
Rap
UK Rap
UK
Northern Ireland
Gaeilge
Expand 
Comments
Add a comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Investors with €500k or more, get our guide and ongoing insights to learn ways to grow your wealth from your portfolio.
(Fisher Investments Ireland)
Who Has the Cheapest Car Insurance in Leinster (Check Eircode)FROM THE WEB
Who Has the Cheapest Car Insurance in Leinster (Check Eircode)
(Car Insurance 2025)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
FROM THE WEB
11 Retirement Blunders to Avoid Once Your Portfolio Reaches €350,000
(Fisher Investments Ireland)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
Brett Gardner’s son, 14, dies in his sleep – family still waiting for answersFROM THE WEB
Brett Gardner’s son, 14, dies in his sleep – family still waiting for answers
(Ohmymag)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
19 Uhr
KILL
Crocs (Snippet)
Bir Yol
CLS
View All
