{
    "id": "guilty-conscience",
    "title": "Guilty Conscience",
    "titleEnglish": "Guilty Conscience",
    "album": "3CAG",
    "year": "2019",
    "duration": "3:20",
    "primaryLanguage": "bilingual",
    "lines": [
      {
        "type": "section",
        "section": "Verse 1 - Móglaí Bap"
      },
      {
        "irish": "Dúbh dóite\nInár suí insan teach\nGan pingin rua againn le fiú dhul amach",
        "english": "Burnt out\nSitting in the house\nNot a red cent between us to even go out"
      },
      {
        "irish": "Tá mé tinn tuirseach de bheith beo bocht\nAch tá sin ar fad ag dhul le athrú anocht",
        "english": "I’m sick and tired of living poor\nBut that’s all about to change tonight"
      },
      {
        "irish": "Mar tá mise 'is Mo Chara ag cur le chéile pleananna\n'Is fuair muid ise ó doirteán, bham, bham, bham",
        "english": "Because me and Mo Chara are putting plans together\nAnd we got her from the sink, bam, bam, bam"
      },
      {
        "irish": "Is roimh i bhfad beidh muid báite insan airgead\nTuilte go maith gan dabht young renegade",
        "english": "And before long we’ll be drowning in money\nWell earned without a doubt, young renegade"
      },
      {
        "irish": "Ag rith thart, tryna grab what we can\nÓ amharc, Mo Chara, sin security van",
        "english": "Running around, trying to grab what we can\nOh look, Mo Chara, that’s a security van"
      },
      {
        "english": "\"Now look man, don't wanna do you no harm\nJust éist leis an scéal and I'm sure it'll be grand",
        "irish": "\"Féach a mhac, níl mé ag iarraidh dochar a dhéanamh ort\nJust listen to the story and I’m sure it’ll be grand"
      },
      {
        "english": "Cause my friend Mo Chara, he's a bit of a psycho\nThe type of fella loses the head at a typo",
        "irish": "Mar tá Mo Chara beagán as a mheabhair\nAn saghas a chaillfeadh a cheann le litreoir"
      },
      {
        "english": "So whatever you do, do whatever he says\nSo éist Mo Chara, abair leis an craic if he says no",
        "irish": "Mar sin cuma céard, déan pé rud a deir sé\nMar éist le Mo Chara, abair leis an scéal mura n-aontaíonn sé"
      },
  
      {
        "type": "section",
        "section": "Verse 2 - Mo Chara"
      },
      {
        "english": "Móglaí get the noose, I'll proper introduce myself\nI'm Mo Chara, and I'm not well, are yis ready for abuse?",
        "irish": "Móglaí, faigh an rópa, lig dom mé féin a chur in aithne i gceart\nIs mise Mo Chara, agus níl mé ceart go leor — an bhfuil sibh réidh le haghaidh ciaptha?"
      },
      {
        "english": "Ach ar dtús I'm sure you're thinking, Aw look\nThat I seem decent and clever, don't I feel bad for this ever?",
        "irish": "Ach ar dtús is dócha go gceapann tú, Awh féach\nGo bhfuil cuma deas agus cliste orm, nach mothaím ciontach faoi seo riamh?"
      },
  
      {
        "type": "section",
        "section": "Chorus"
      },
      {
        "english": "Guilty conscience, no thanks\nI meditate and have plenty of wanks",
        "irish": "Coinsias ciontach? Ní hea\nDéanaim machnamh agus déanfaidh mé neart strócála"
      },
      {
        "english": "And I never spare a second thought for cunts in suits\nAnd when the revolution comes, I'm first out to loot",
        "irish": "Agus ní smaoiním riamh ar na ladanna i gculaith\nAgus nuair a thagann an réabhlóid, is mise an chéad cheann ag loitiméireacht"
      },
      {
        "english": "New guds (new guds), happy days (happy days)\nSo much comfort when you don't have to pay",
        "irish": "Rudaí nua (rudaí nua), laethanta sona (laethanta sona)\nAn oiread sin compoird nuair nach gcaithfidh tú íoc"
      },
      {
        "english": "And when I'm happily tripped in designer gear\nThen all of you cunts are getting one behind the ear",
        "irish": "Agus nuair atá mé gleasta go gléasta i mbrandaí galánta\nBeidh gach duine agaibh ag fáil ceann sa chluas"
      },
  
      {
        "type": "section",
        "section": "Verse 3 - Mo Chara"
      },
      {
        "english": "Go raibh maith agat Móglaí , ar aghaidh linn in the stoley",
        "irish": "Thanks Móglaí, on we go with the robbery"
      },
      {
        "english": "Oíche Shathairn, 'mon go haifreann\nThe collection box owes me",
        "irish": "Saturday night, come on to Mass\nTá an bosca bailithe i bhfiacha liom"
      },
      {
        "english": "Agus tá sé te teolaí\n'is lán le pensioners homie",
        "irish": "And it’s warm and cosy\nAnd full of pensioners, homie"
      },
      {
        "english": "Tiocfaidh linn tús a cur le gaelgiggolos arís if you're lonely",
        "irish": "We can start up the gaelgiggolos again if you’re lonely"
      },
      {
        "english": "Money's no more stress, buíochas le G4S",
        "irish": "Money’s no longer stress, thanks to G4S"
      },
      {
        "english": "Tá ár bhfiacha ar fad íoctha, now it's time to invest, huh?",
        "irish": "All our debts are paid, now it’s time to invest, huh?"
      },
      {
        "english": "Nah, I'm giving half to me ma\nSome blood money for my honeys\nAnd the rest to the 'ra",
        "irish": "Níl, tá leath ag dul chuig mo mháthair\nAirgead salach do na cailíní\nAgus an chuid eile chuig an 'ra"
      },
  
      {
        "type": "section",
        "section": "Chorus (Repeat)"
      },
      {
        "english": "Guilty conscience, no thanks\nI meditate and have plenty of wanks...",
        "irish": "Coinsias ciontach? Ní hea\nDéanaim machnamh agus déanfaidh mé neart strócála..."
      },
      {
        "english": "OBE's for the landlords",
        "irish": "OBEanna do na tiarnaí talún"
      }
    ]
  }
  