{
  "id": "mam",
  "title": "Mam",
  "titleEnglish": "Mam",
  "album": "Single",
  "year": "2025",
  "duration": "3:18",
  "primaryLanguage": "bilingual",
  "lines": [
    {
      "type": "section",
      "section": "Lyrics Coming Soon"
    },
    {
      "irish": "Lyrics will be added here...",
      "english": "Lyrics will be added here...",
      "language": "bilingual"
    }
  ]
}

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Mam by Kneecap
Mam
Kneecap
Featuring
Dyrt
Track 1 on
Mam - Single 
Dec. 3, 2020
1 viewer
16.6K views




10 Contributors
Mam Lyrics
[Moglaí Bap]
Grá mo chroí, mo mhamaí, cé go raibh mé cineál scanraithe
Nuair a tháinig sí abhaile ‘s an teach go hiomlán salach
Níl mé ag iarraidh tabhairt amach, no, níl mé ag iarraidh troid anocht lad
Tá an cheann seo duitse, mo mhamaí cliste

Pasta pesto, prátaí rósta, teach go hiomlán focain reoite
Saoire fada ar an chósta ‘s cleachtadh ceol, I nearly lost it
Níl mé ag iarraidh tabhairt amach, no, níl mé ag iarraidh troid anocht lad
Tá an cheann seo duitse, mo mhamaí cliste

'Cause níl faic níos crua de na single mas
She’d knock the cunt out of any da, she’d break a jaw
Dá mbeadh an gá, she’d go berzerk gan any fáth
Like, "níor ghlan tú an focain leithreas i gceart, ye wee focan shite"
Foc, that’s me gettin’ bate again tonight, and then Dyrt goes...

[DYRT]
Thank fuck mam's don’t do a runnеr
'Cause some dads spend yеars buying butter
I just took another line with my brother
So I want to tell my mam that I love her

[Curfá]
Seo ceann do na mná, a bhíonn ag obair gach lá
Ag cur iad féin i mbaol, oh, ar mhaithe lenár saoil
Seo ceann do mo mhamaí, gan thú bheinn tanaí
Gan thú bheinn a banaí, oh is grá liom thú a mamaí...
See Kneecap Live
Get tickets as low as $81

You might also like
THE RECAP (Bootleg Version)
Kneecap
H.O.O.D
Kneecap
Better Way to Live
Kneecap
[DYRT]
My father's child, my mother's son
That line can be troublesome
Ah sure, what's done is done
And my mother is a stubborn cunt
For a son, no needed assistance
'Twas Breda and Vincent 'til he flew off and left me in Breda's hands
'Cause my father had Peter Pan syndrome symptoms
But I don't begrudge you Vince
I'm sure that you loved your kids
You just weren't able to be there enough because of trauma you suffer with, but fuck it, it's
All in the past, it's all in the bag I haul on my back
And never complained, it brought me the knack of knowing how trauma impacts
Kids are whacked-out without thought for their mam when she's giving them all that she can
Trapped in their self-centered thoughts about all that they lack because they're missing a bond with their dad
But she played dad when the job was his, so I want to say thanks for all you did
Every cloud, as they say, the problem is
That's just another line that I'll probably sniff

[Curfá]
Seo ceann do na mná, a bhíonn ag obair gach lá
Ag cur iad féin i mbaol, oh, ar mhaithe lenár saoil
Seo ceann do mo mhamaí, gan thú bheinn tanaí
Gan thú bheinn a banaí, oh is grá liom thú a mamaí...

[Mo Chara]
Is grá liom thú mamaí, a mhamaí, ye had me eating shite dinners like spuds and salami
Ach is cuimhin liom go minic bheadh braillín úr nuair a thiocfas mé abhaile ar mo leabaí
Ar bith ar mé ag spraoi, since I fell out your gee
Ní minic a bhfeicfinn tú i do shuí
Mo mhamaí, mo laoch, táim buíoch duit mar bhí
I gcónaí bia ar mo phláta, calling me do wee ghrása
And you never went mad, whenever I had a cóisir i do theach
Is mó an bhuíochas leatsa, mo mháthair croíúil snasta
As mo bheatha, cuimhní sásta, and slapping me when you had to
[DYRT]
So thank fuck mam's don’t do a runner
'Cause some dads spend years buying butter
I just took another line with my brother
So I want to tell my mam that I love her

[Curfá]
Seo ceann do na mná, a bhíonn ag obair gach lá
Ag cur iad féin i mbaol, oh, ar mhaithe lenár saoil
Seo ceann do mo mhamaí, gan thú bheinn tanaí
Gan thú bheinn a banaí, oh is grá liom thú a mamaí...

Seo ceann do na mná, a bhíonn ag obair gach lá
Ag cur iad féin i mbaol, oh, ar mhaithe lenár saoil
Seo ceann do mo mhamaí, gan thú bheinn tanaí
Gan thú bheinn a banaí, oh is grá liom thú a mamaí...



Embed
About
This song bio is unreviewed
Genius Annotation
1 contributor
MAM a powerful and emotional tribute to mothers, blending raw vulnerability with the group’s signature lyrical depth. Written before the devastating loss of bandmember Móglaí Bap’s mother to suicide, the song carries an intimate weight, offering both love and remembrance.

The track showcases Kneecap’s ability to balance heartfelt storytelling with a universal message, touching on themes of family, grief, and resilience. With all proceeds going to Samaritans, the song not only honors their mothers but also aims to raise awareness and support for mental health.




Share
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
What did Kneecap say about "Mam"?

Verified Commentary
Kneecap
via Instagram
Genius Answer
1 contributor
For our latest project with DYRT we wanted to create one song that’s a bit different from the usual.
So we decided to do a tune about somethin real, our Mothers.
I was really looking forward to lettin Mam hear the tune but i told her she’d have to wait til it’s done, I wanted it to be perfect for her.
Unfortunately, i lost my mother recently to suicide and it broke my heart that she never got to hear it.
Keep and eye out for eachother especially over crimbo 💚
We’re going to have the single on sale next week to raise money for Samaritans charity
If anyone ever needs a chat send us a message Ns.
Mam, tá an ceann seo duitse.
Móglaí Bap x

+4
When did Kneecap release “Mam”?

Who wrote “Mam” by Kneecap?

Mam - Single (2020)
Kneecap
1.
Mam
Credits
Featuring
Dyrt
Writers
Móglaí Bap, Mo Chara & Dyrt
Released on
December 3, 2020
Tags
Rap
Comments
Add a comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Investors with €500k or more, get our guide and ongoing insights to learn ways to grow your wealth from your portfolio.
(Fisher Investments Ireland)
I couldn’t admit it to myself' – Brian May reveals guilt over having feelings for Anita DobsonFROM THE WEB
I couldn’t admit it to myself' – Brian May reveals guilt over having feelings for Anita Dobson
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
FROM THE WEB
11 Blunders to Avoid to Help You Retire Comfortably
(Fisher Investments Ireland)
Liam Payne's father had warned that the singer should never be left aloneFROM THE WEB
Liam Payne's father had warned that the singer should never be left alone
(NEWS/OhMyMag.co.uk)
Arsenal's Alex Scott confirms romance with this former female teammateFROM THE WEB
Arsenal's Alex Scott confirms romance with this former female teammate
(Ohmymag)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
Animals (Pt. I)
HUNTR/X - Golden (Romanized)
Free
What It Sounds Like
How It’s Done
View All
