

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

1
Cover art for Thart agus Thart by Kneecap
Thart agus Thart
Kneecap
Producer
BLVTH
Track 1 on
Thart agus Thart - Single 
Oct. 13, 2021
1 viewer
33.2K views




18 Contributors
Thart agus Thart Lyrics
[Hook]
Thart agus thart
Big skins, thíos ag an mini mart
Few loose Capri Sun and a Mars Bar
Dúid mhór salach ansin tá mé thar barr
Thart agus thart
Cosúil le mo mhéilteoir ya
Fear beag gnaitheach when I’m on tour
No top, moshpit, sweaty balls, encore

[Verse 1]
Lá eile cac céanna
'Dom an stuif, cuirfidh mé ceann le chéile
Móglaí an tógalaí fáilte chuig an bráinse is úra glas de na hóglaigh
Ceithre uair is fichid
Cead rud ar maidin agus mall in san oiche
Fuck all else le bheith déanamh thart anseo
Anois ar ais chuig an siopa to get a pack of raws
Caught in a loop like I'm tryna read a book but it’s the same page over and over and over and over and over and over
Caught in the loop like I'm tryna read a book but it’s the same page over and over and over and over and over and over
Ah fuck I'll just watch a movie

[Bridge]
Gafa sa loop, groundhog day point two
It's been too long, I need an encore and sweaty balls too
Gafa sa loop, nothin' to do
It's been too long, I need an encore and sweaty balls too
See Kneecap Live
Get tickets as low as $81

You might also like
Fenian Cunts
Kneecap
C.E.A.R.T.A
Kneecap
Get Your Brits Out
Kneecap
[Interlude]
Why? What are we gonna do tomorrow night?
The same thing we do every night, Pinky. Try to take—
Drugs

[Verse 2]
I miss love buzz hugs 'is ag ól mo chuid le festival thugs
I mo mucked up guds, ag suppáil suds le random cunts
Ach i rith an amá, dhá harp déag agus mála Maradonna and I wanna get a half or a q then I laugh at the news as the madness ensues, tá mé gafa sa loop

[Bridge]
Gafa sa loop, groundhog day point two
It's been too long, I need an encore and sweaty balls too
Gafa sa loop, nothin' to do
It's been too long, I need an encore and sweaty balls too

[Hook]
Thart agus thart
Big skins, thíos ag an mini mart
Few loose capri sun and a mars bar
Dúid mhór salach ansin tá mé thar barr
Thart agus thart
Cosúil le mo mhéilteoir ya
Fear beag gnaitheach when I’m on tour
No top, moshpit, sweaty balls, encore



1
Embed
About
This song bio is unreviewed
Genius Annotation
1 contributor
Written during the COVID-19 lockdown, “Thart agus thart” (Round and round), the song describes the band’s boredom with the repititiveness of being stuck in the house, and missing being out and performing.




Share
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
Who produced “Thart agus Thart” by Kneecap?

When did Kneecap release “Thart agus Thart”?

Who wrote “Thart agus Thart” by Kneecap?

Thart agus Thart - Single (2021)
Kneecap
1.
Thart agus Thart
Expand 
Credits
Producer
BLVTH
Writers
Mo Chara & Móglaí Bap
Released on
October 13, 2021
Tags
Rap
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
11 Blunders to Avoid to Help You Retire ComfortablyFROM THE WEB
11 Blunders to Avoid to Help You Retire Comfortably
For individuals with a €500k+ portfolio, get our guide and ongoing insights to help plan the retirement you deserve.
(Fisher Investments Ireland)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(NEWS/OhMyMag.co.uk)
Alex Scott confirms romance with former Arsenal teammate: "I was madly in love. It didn't bode well"FROM THE WEB
Alex Scott confirms romance with former Arsenal teammate: "I was madly in love. It didn't bode well"
(Ohmymag)
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Investors with €500k or more, get our guide and ongoing insights to learn ways to grow your wealth from your portfolio.
(Fisher Investments Ireland)
Tim Curry: rare public appearance sparks concern among fansFROM THE WEB
Tim Curry: rare public appearance sparks concern among fans
(Ohmymag)
Do you have a mouse? Play this game for 1 minuteFROM THE WEB
Do you have a mouse? Play this game for 1 minute
Play for free. No Installation.
(Combat Siege)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
KILL
Crocs (Snippet)
Bir Yol
CLS
Free
View All
