

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

1
Cover art for Bouncers by Kneecap
Bouncers
Kneecap
Track 8 on
3CAG 
Jun. 25, 2018
1 viewer
8.4K views




14 Contributors
Bouncers Lyrics
Half eight, pleasing not much of a top
No more mála fa choinne Móglai Bap
Fear úr nua ag fágáil slán leis an clap
‘Nois beidh [?] ort muna n-íocann tú straip
Léine deas úr don oíche anocht
Agus dhíol mé deich kilo cóc so níl me bocht
Gach uile dhuine hooked ach ní ormsa an locht
Mar tá Nike Air Max daor, thart fa ochtó punt

Right, fast forward
Swig amháin eile, sipín beag Stella, le cuidiú le mo bhuama
Go fóill stuama, Bouncer insan cúinne, looks like a welter
Díreach i mó shúile
"Not tonight mate, I think you’ve had enough"
So thug me dorn san aghaidh dó agus bhris me a phus
Tháinig ceann amháin eile boot cúl le mo chos
Just let me know mate when you’ve had e-fucking-nough

Na bac leis an cac a tugann bouncers duit
Sure, tá sé beagnach trí bhliain ó a bholadh sé phit
Agus ní labhraíonn sé lena mháthair
He says she's a bitch
Is focain cunt mór ramhar é ach tá pleain agaim anois
Eagróidh muid ár áit féin, gan bouncers, gan péas
An áit lan cócain, lán mná, lán grá, people we can entertain
Foc bouncers asking for your date of birth and your name
See Kneecap Live
Get tickets as low as $81

You might also like
Fine Art
Kneecap
Incognito
Kneecap
Sick In The Head
Kneecap
[Cúrfa]
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Cad é an focain craic? An bhfuil na speakers ar an bhhealach?
Tá súil agam gur chíos tú iad níl mise chun iad a cheannach
DJ Próvaí ar na tunes, bangers go deo
Agus ullmhaidh muid na cannaí [?] daoine leo
Cur na soilse anseo, os comhair na decks
Níl aon focain dress code, cuir ort Nike Air Max
Caith aon rúd ar mhaith leat agus focain relax
Mar anocht ní bheidh aon focain bouncers san áit

Mar thosaigh muid ciorcáil cómhra
Idir na Mas agus na bouncers móra
Agus ní nach ionadh go bhfuil daoine ag smaoineadh
An bhfaca mé na dirty focain bouncers ag caoineadh?
Let it all out, mo chara's here for a cry
I’m only joking now imigh as mo radharc and die
Is cuma le Mo Chara, so foc faoi do chuid fadhbanna
Mar gheall ar na oícheanta ar fhagadh mé sna sráideanna
[Cúrfa]
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Bí go deas, cneas(ta), ciúin ag iarraidh áit a aimsiú
"Hello, kind sir, would you like Christ to find you?"
Bí muiníneach, cliste, gan aon rud a briseadh
Just éist go cúramach, seo an dóigh é a dhéanadh
Coinnigh súil géar amach agus béidh tú go brea
Agus coinnigh píosa beag hash ar feadh teacht an Ra
Mar atá i ngnáth nuair a thagann siad gan a rá
We say "fuck the Queen" agus "tiocfaidh ár lá"

[Cúrfa]
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Do rogha féin ar an bealach isteach
We got smoke, cóc, hash agus frosty jack
We got dídeain, even if you’re wrecked
Agus no focain bouncer ag cur stop leis an craic
We got milseáin when your jaws flyin’ it
We got uisce when you really feelin’ it
We got a strict new policy guaranteed:
Níl fáilte roimh na Gardaí

Ná íoc isteach and tóg iompair amach
And foc bouncers, ná tabhair aon aitheantais leat
Tá sé faoi smacht, it's self-policed anocht
Seo blaisín den muirtheas atá le teacht
Ó Kneecap, triúir focain cheeky bastards
Your dad’s a disgrace and your life’s a disaster
Cá bhfuil do dheirfiúir? An bhfuil achan rud casta?
Mar phléasc mé go luath agus d’imigh mé go gasta

[Cúrfa]
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

[Cúrfa]
Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

Bouncers, níos measa ná na péas
Bouncers, cosúil leis an S.S
Bouncers, níos deise insan Kesh
Knocking me back agus wreckin' the sesh

("Nah lads, that’s not fair
They're only doin' their job, so they are")



1
Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
When did Kneecap release “Bouncers”?

Who wrote “Bouncers” by Kneecap?

3CAG (2018)
Kneecap
1.
Your All Legitimate Targets
2.
Amach Anocht
3.
Tá na Baggies ar an Talamh
4.
C.E.A.R.T.A
5.
Incognito
6.
Ceacht Mo Chara
7.
Your Sniffer Dogs Are Shite
8.
Bouncers
Credits
Writers
Móglaí Bap & Mo Chara
Released on
June 25, 2018
Tags
Rap
Northern Ireland
UK
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
FROM THE WEB
11 Retirement Blunders to Avoid Once Your Portfolio Reaches €350,000
(Fisher Investments Ireland)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
Tim Curry spotted in wheelchair in rare public outing - here's how a stroke changed his lifeFROM THE WEB
Tim Curry spotted in wheelchair in rare public outing - here's how a stroke changed his life
(Ohmymag)
The most realistic game 2025. If you own a mouse, play it for 1 minute.FROM THE WEB
The most realistic game 2025. If you own a mouse, play it for 1 minute.
Play for free. No Installation.
(Combat Siege)
Drink 1 Cup Every Morning – See What Happens A Week Later!FROM THE WEB
Drink 1 Cup Every Morning – See What Happens A Week Later!
(Health Watcher)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
JOYRIDE.
In Her Mouth
Photo Copied
Program
BOY CRAZY.
View All
