{
    "id": "bouncers",
    "title": "Bouncers",
    "titleEnglish": "Bouncers",
    "album": "Fine Art",
    "year": 2024,
    "duration": "4:06",
    "primaryLanguage": "bilingual",
    "lines": [
      { "type": "section", "section": "Verse 1" },
      {
        "irish": "Half eight, pleasing not much of a top\nNo more mála fa choinne Móglai Bap",
        "english": "Half eight, not wearing much of a top\nNo more bag for Móglai Bap"
      },
      {
        "irish": "Fear úr nua ag fágáil slán leis an clap\n‘Nois beidh [?] ort muna n-íocann tú straip",
        "english": "A new man saying goodbye to the clap\nNow you’ll be [??] unless you pay a strip"
      },
      {
        "irish": "Léine deas úr don oíche anocht\nAgus dhíol mé deich kilo cóc so níl me bocht",
        "english": "A fresh new shirt for tonight\nAnd I sold ten kilos of coke so I’m not broke"
      },
      {
        "irish": "Gach uile dhuine hooked ach ní ormsa an locht\nMar tá Nike Air Max daor, thart fa ochtó punt",
        "english": "Everyone's hooked but it’s not my fault\nBecause Nike Air Max are dear, about 80 quid"
      },
      {
        "irish": "Right, fast forward\nSwig amháin eile, sipín beag Stella, le cuidiú le mo bhuama",
        "english": "Right, fast forward\nOne more swig, small sip of Stella to help with my buzz"
      },
      {
        "irish": "Go fóill stuama, Bouncer insan cúinne, looks like a welter\nDíreach i mó shúile",
        "english": "Still steady, bouncer in the corner, looks like a welterweight\nRight in my eyes"
      },
      {
        "irish": "\"Not tonight mate, I think you’ve had enough\"\nSo thug me dorn san aghaidh dó agus bhris me a phus",
        "english": "\"Not tonight mate, I think you’ve had enough\"\nSo I punched him in the face and broke his jaw"
      },
      {
        "irish": "Tháinig ceann amháin eile boot cúl le mo chos\nJust let me know mate when you’ve had e-fucking-nough",
        "english": "Another came and booted the back of my leg\nJust let me know mate when you’ve had enough"
      },
      { "type": "section", "section": "Verse 2" },
      {
        "irish": "Na bac leis an cac a tugann bouncers duit\nSure, tá sé beagnach trí bhliain ó a bholadh sé phit",
        "english": "Ignore the crap bouncers give you\nIt’s been nearly three years since he smelled a bit"
      },
      {
        "irish": "Agus ní labhraíonn sé lena mháthair\nHe says she's a bitch",
        "english": "And he doesn’t talk to his mother\nHe says she’s a bitch"
      },
      {
        "irish": "Is focain cunt mór ramhar é ach tá pleain agaim anois",
        "english": "He’s a big fat fuckin’ cunt but I’ve got a plan now"
      },
      {
        "irish": "Eagróidh muid ár áit féin, gan bouncers, gan péas",
        "english": "We’ll organise our own place, no bouncers, no cops"
      },
      {
        "irish": "An áit lan cócain, lán mná, lán grá, people we can entertain",
        "english": "A place full of cocaine, full of women, full of love, people we can entertain"
      },
      {
        "irish": "Foc bouncers asking for your date of birth and your name",
        "english": "Fuck bouncers asking for your date of birth and your name"
      },
      { "type": "section", "section": "Chorus" },
      {
        "irish": "Bouncers, níos measa ná na péas\nBouncers, cosúil leis an S.S\nBouncers, níos deise insan Kesh\nKnocking me back agus wreckin' the sesh",
        "english": "Bouncers, worse than the cops\nBouncers, like the S.S.\nBouncers, nicer inside the Kesh\nKnocking me back and wrecking the sesh"
      },
      { "type": "section", "section": "Verse 3" },
      {
        "irish": "Cad é an focain craic? An bhfuil na speakers ar an bhhealach?\nTá súil agam gur chíos tú iad níl mise chun iad a cheannach",
        "english": "What the fuck’s the craic? Are the speakers on the way?\nI hope you paid for them, I’m not buying them"
      },
      {
        "irish": "DJ Próvaí ar na tunes, bangers go deo\nAgus ullmhaidh muid na cannaí [?] daoine leo",
        "english": "DJ Próvaí on the tunes, proper bangers\nAnd we’ll prep the cans [?] for people with them"
      },
      {
        "irish": "Cur na soilse anseo, os comhair na decks\nNíl aon focain dress code, cuir ort Nike Air Max",
        "english": "Put the lights here, in front of the decks\nThere’s no fucking dress code, wear your Nike Air Max"
      },
      {
        "irish": "Caith aon rúd ar mhaith leat agus focain relax\nMar anocht ní bheidh aon focain bouncers san áit",
        "english": "Wear whatever you want and fucking relax\nBecause tonight there’ll be no fuckin’ bouncers in the place"
      },
      {
        "irish": "Mar thosaigh muid ciorcáil cómhra\nIdir na Mas agus na bouncers móra",
        "english": "Because we started a circle of dialogue\nBetween the MAs and the big bouncers"
      },
      {
        "irish": "Agus ní nach ionadh go bhfuil daoine ag smaoineadh\nAn bhfaca mé na dirty focain bouncers ag caoineadh?",
        "english": "And it’s no surprise people are wondering\nDid I see the dirty fuckin’ bouncers crying?"
      },
      {
        "irish": "Let it all out, mo chara's here for a cry\nI’m only joking now imigh as mo radharc and die",
        "english": "Let it all out, my friend’s here for a cry\nI’m only joking, now get out of my sight and die"
      },
      {
        "irish": "Is cuma le Mo Chara, so foc faoi do chuid fadhbanna\nMar gheall ar na oícheanta ar fhagadh mé sna sráideanna",
        "english": "Mo Chara doesn’t care, so fuck your problems\nBecause of all the nights I was left in the streets"
      },
      { "type": "section", "section": "Chorus" },
      {
        "irish": "Bouncers, níos measa ná na péas\nBouncers, cosúil leis an S.S\nBouncers, níos deise insan Kesh\nKnocking me back agus wreckin' the sesh",
        "english": "Bouncers, worse than the cops\nBouncers, like the S.S.\nBouncers, nicer inside the Kesh\nKnocking me back and wrecking the sesh"
      },
      { "type": "section", "section": "Verse 4" },
      {
        "irish": "Bí go deas, cneas(ta), ciúin ag iarraidh áit a aimsiú\n\"Hello, kind sir, would you like Christ to find you?\"",
        "english": "Be nice, gentle, quiet trying to find a place\n\"Hello, kind sir, would you like Christ to find you?\""
      },
      {
        "irish": "Bí muiníneach, cliste, gan aon rud a briseadh\nJust éist go cúramach, seo an dóigh é a dhéanadh",
        "english": "Be confident, clever, don’t break anything\nJust listen carefully, this is how to do it"
      },
      {
        "irish": "Coinnigh súil géar amach agus béidh tú go brea\nAgus coinnigh píosa beag hash ar feadh teacht an Ra",
        "english": "Keep a sharp eye and you’ll be grand\nAnd keep a little hash for the arrival of Ra"
      },
      {
        "irish": "Mar atá i ngnáth nuair a thagann siad gan a rá\nWe say \"fuck the Queen\" agus \"tiocfaidh ár lá\"",
        "english": "As is normal when they come without warning\nWe say \"fuck the Queen\" and \"our day will come\""
      },
      { "type": "section", "section": "Chorus" },
      {
        "irish": "Do rogha féin ar an bealach isteach\nWe got smoke, cóc, hash agus frosty jack",
        "english": "Your own choice at the entrance\nWe’ve got smoke, coke, hash and frosty jack"
      },
      {
        "irish": "We got dídeain, even if you’re wrecked\nAgus no focain bouncer ag cur stop leis an craic",
        "english": "We’ve got shelter even if you're wrecked\nAnd no fucking bouncer stopping the craic"
      },
      {
        "irish": "We got milseáin when your jaws flyin’ it\nWe got uisce when you really feelin’ it",
        "english": "We’ve got sweets when your jaw is flying\nWe’ve got water when you're really feeling it"
      },
      {
        "irish": "We got a strict new policy guaranteed:\nNíl fáilte roimh na Gardaí",
        "english": "We’ve got a strict new policy guaranteed:\nThe cops are not welcome"
      },
      {
        "irish": "Ná íoc isteach and tóg iompair amach\nAnd foc bouncers, ná tabhair aon aitheantais leat",
        "english": "Don’t pay in and take carry-out\nAnd fuck bouncers, don’t bring any ID"
      },
      {
        "irish": "Tá sé faoi smacht, it's self-policed anocht\nSeo blaisín den muirtheas atá le teacht",
        "english": "It’s under control, it’s self-policed tonight\nThis is a taste of the mayhem to come"
      },
      {
        "irish": "Ó Kneecap, triúir focain cheeky bastards\nYour dad’s a disgrace and your life’s a disaster",
        "english": "From Kneecap, three fuckin' cheeky bastards\nYour dad’s a disgrace and your life’s a disaster"
      },
      {
        "irish": "Cá bhfuil do dheirfiúir? An bhfuil achan rud casta?\nMar phléasc mé go luath agus d’imigh mé go gasta",
        "english": "Where’s your sister? Is everything a mess?\nBecause I blew up quick and left just as fast"
      },
      { "type": "section", "section": "Chorus" },
      {
        "irish": "Bouncers, níos measa ná na péas\nBouncers, cosúil leis an S.S\nBouncers, níos deise insan Kesh\nKnocking me back agus wreckin' the sesh",
        "english": "Bouncers, worse than the cops\nBouncers, like the S.S.\nBouncers, nicer inside the Kesh\nKnocking me back and wrecking the sesh"
      },
      {
        "irish": "(\"Nah lads, that’s not fair\nThey're only doin' their job, so they are\")",
        "english": "(\"Nah lads, that’s not fair\nThey're only doing their job, so they are\")"
      }
    ]
  }
  