

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Ceacht Mo Chara by Kneecap
Ceacht Mo Chara
Kneecap
Track 6 on
3CAG 
Jun. 25, 2018
1 viewer




10 Contributors
Ceacht Mo Chara Lyrics
Fáiltigí go Ceacht mo Chara (Hello)
Foghlaim seo agus ní bheidh tú ag teacht sa dara háit
Banging out 3CAG agus mé ar stáitse
Ar seachrán ó na Gardaí ón tseachtain seo caite
Tá éad orthu mar gheall go bhfuil mo pubes ildaite
Faic fágtha le rá

Don't change the drug laws because I’m raking it in gach lá
Ach sílim gur gá do na Péas iad féin a choinneáil stuama
Ar Bhóthar na bhFál ní bheidh tú i bhfad ar shiúl ó phetrol-buama
Buama peitril ag éist' le techno beidh mise ar shiúl ní bheidh mise le feiceáil
Gardaí ag seiceáil tá mise ag pacáil amach sna sléibthe cosúil le jackal
'Cause that’s where I hide, níl an RUC on my side
Just ar feadh cúpla, an méid sin, táim ar ais i focain paradise
An Gaeilgeoir 'Mr. Nice' a chuirtear orm
Ar fáil fríd an ghrian, ghaoth, bháistí agus stoirm
Mar tá sneachta ann 'ar go' ó Mo Chara ar lá tirim
Agus tá Dan Healy paranoid faoi achan abairt a dheirim
Fuck the Pope, I'm selling dope le Bishop Brennan
Fuck the Queen, I'm selling green le achan cunt sa Kremlin
LSD nó piollaí, focain díolaim an t-iomlán
("How many should I take, Mo Chara said three or something?")

Pearsantachtaí difriúla when I'm selling an 3CAG
Múinte le posh pricks and acting hard leis na scumbags
Sometimes you have to bite your tongue leis na meánaicmigh
Exactly, due the focain airgead sexy
Eventually, imíonn siad, couple o’ quid down
The clowns, running around, saying that legend Mo Chara’s sound
Ach i bhfírinne bhí orm é a dhíol níos daoire daofa
Mar bím i gcónaí ag iarraidh go mbeidh sé níos saoire do na
Leaids as an cheantar nach bhfaigheann laethanta saoire ar bith
Sniff that mate and you'll be back in Ibiza arís
See Kneecap Live
Get tickets as low as $81

You might also like
Your Sniffer Dogs Are Shite
Kneecap
I bhFiacha Linne
Kneecap
Thart agus Thart
Kneecap
[Curfá/Chorus]
Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara’s everywhere
Ar an drabhlás anocht

Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara's everywhere
Ar an drabhlás anocht

Achan duine buartha faoi Mo Chara
Mar gheall go bhfuil barraíocht ama aige
Mar go bhfuil barraíocht bán aige
Mar gur as Bóthar na Carraige
Báine dó
Is léir go bhfuil Mo Chara the opposite the [?]
Ní imrím cluichí seachas Cribby 'is Dizzy Dinosaurs
Inseoidh mé duit once more
Ní shílim i bhfírinne gur chóir
Éisteacht le RTÉ nó beidh cuairteoir at your Ma's front door
Smashing up your radio then giving myself fellatio
I dteach do mháthar a gimp suit leathair
Hanging in her patio
I still prefer your Granny though
Burting her like a fanny coat
Horn agus féasóg uirthi, she look’s like a manly goat
Kneecap, givin' your Da a vesectomy
I'll beat your brother at FIFA when your Ma is erectin' me
Tá do dheirfiúr next to me, I'm selling her ecstasy
Rapping i ndátheangach coursing through my anatomy

[Curfá/Chorus]
Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara's everywhere
Ar an drabhlás anocht

Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara's everywhere
Ar an drabhlás anocht

Cúpla siolla eile sure just don focain craic
Agus cúpla líne eile pure before I hit the sack
Nuair a dhéanann na Péas seic
Faigheann siad faic
Mar tá mo dope about an inch and a half up my crack
De réir boring bastards, tá mé drochbhéasach
Ach ag déanamh a bheag de dhaoine is what I'm best at
Like when I wipe my arse with your wee sister's vest top
Agus chuir mé i bhfolach é in a charity shop (Eugh)
"Ó mo Dhia, tá tú focain cáidheach"
Throw your baby into the fire
Achan duine thíos for the Messiah
Ní féidir liom bás a fháil and I'll never retire
Tá mé imithe ar focain strae
Cuirim scairt ar focain Babestation i rith an lae
Melting heads, is breá liom é
Cuirfidh mé isteach ar dhaoine, go dtí go dtéim ag ré'

[Curfá/Chorus]
Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara's everywhere
Ar an drabhlás anocht

Mo Chara i do cheantar
Mo Chara i do theach
Mo Chara's everywhere
Ar an drabhlás anocht



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
When did Kneecap release “Ceacht Mo Chara”?

Who wrote “Ceacht Mo Chara” by Kneecap?

3CAG (2018)
Kneecap
1.
Your All Legitimate Targets
2.
Amach Anocht
3.
Tá na Baggies ar an Talamh
4.
C.E.A.R.T.A
5.
Incognito
6.
Ceacht Mo Chara
7.
Your Sniffer Dogs Are Shite
8.
Bouncers
Credits
Writer
Mo Chara
Released on
June 25, 2018
Tags
Rap
UK
Northern Ireland
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
FROM THE WEB
When Will You Be Able to Retire?
(Fisher Investments Ireland)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
Peter Crouch's wife makes unexpected marriage confession: 'We live separate lives now'FROM THE WEB
Peter Crouch's wife makes unexpected marriage confession: 'We live separate lives now'
(Ohmymag)
Football legend Ally McCoist reveals he has an incurable disease: 'It's a hereditary thing'FROM THE WEB
Football legend Ally McCoist reveals he has an incurable disease: 'It's a hereditary thing'
(NEWS/OhMyMag.co.uk)
Drink 1 Cup Every Morning – See What Happens A Week Later!FROM THE WEB
Drink 1 Cup Every Morning – See What Happens A Week Later!
(Health Watcher)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
Free
What It Sounds Like
HUNTR/X - Golden (Romanized)
Animals (Pt. I)
How It’s Done
View All