

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

2
Cover art for C.E.A.R.T.A by Kneecap
C.E.A.R.T.A
Kneecap
Producer
Gunna Bango
Track 4 on
3CAG 
Dec. 15, 2017
1 viewer
224.1K views




31 Contributors
C.E.A.R.T.A Lyrics
Liricí do C.E.A.R.T.A le Kneecap

[Moglaí Bap — Véarsa 1]
Foc mí, ní fhaca mé na bastairdí
Carr dubh ina bhfolach ar ár mullach is iad taobh istigh
Seans ar bith, go bhfaighidh siad mo mhála MD
Mar tá cóisir ann anocht ‘s níl fáilte roimh an RUC

Is gan dabht, tá mise ar bís
Le dul síos ar an snaois arís ‘s arís
Is ní stopfaidh mé go maidin mar ní socraím síos
Agus fuair mé mála mór ket in ionad mo chíos

[Mo Chara — Véarsa 2]
Níl tú ag focan éisteacht liom níl seo ina focan jóc
Tá mé ag iarraidh a bheidh ag an chóisir leat ag ithe cúpla yokes
Ag déanamh cúpla líne bhán don phúdar mín cóc
Is tiocfaidh deireadh na hoíche ‘s béimid ar fad ag gol den smoke

Ach má rugtar orainn inniú
Is muidinne a bheas thíos leis i bhfaiteadh na súl
Mar tá na muca móra mire sa tóir ar ár meon
Is beidh lucht Maghaberry sa tóir ar mo thóin

[Cúrfa]
C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada
See Kneecap Live
Get tickets as low as $81

You might also like
H.O.O.D
Kneecap
Get Your Brits Out
Kneecap
Fenian Cunts
Kneecap
C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

[Mo Chara — Véarsa 3]
Dúirt mé leat cheana, seo an chúis le Balaclava
Is féidir siúil ar shiúil, ‘s ní aithneoidh siad tada
Tá ‘gear’ is fearr in iarthar Bhéal Feirste againn le fada
Cóc, speed, e’s agus moll marijuana
Ag teacht isteach go ciúin fríd shléibhte Chonamara

Ag cóisireacht le Tinky Winky agus Seamus Barra
Ní stopaim ón gheimhreadh fríd go dtí an earrach
Díolaim snaois le do Mhamó, do mhac ‘is do chara
A n-íocann as má laethanta saoire ar an bhFál Carrach

[Moglaí Bap — Véarsa 4]
Níl aon chathair nach bhfuil muid ann faoi lathair
Doire, Corcaigh agus fiú amháin D4
Ag scriosadh na háite ar mhaithe le bheith saibhir
Ansin ag déanamh snaois bhán le réaltaí TG4

So goitse anois, agus déanfaimid deifir
Mar tá mise ró-stuama anois faoi láthair
Agus beidh muid ag dul go maidin le Rónán Mac An Rí
‘cause’ foc na riallacha atá ag RTÉ
[Cúrfa]

C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

[Mogalí Bap — Véarsa 5]
Tógadh Mo Chara agus muid ar an bhealach
Cé gur thug mé smack ceart don gharda salach
Bhí orm rith na bhaile agus dul ina bhfolach
Mar bhí 10 kilo cóc taped ar mo bhrollach

Anois ní sin le rá go raibh mé scanraithe
Sure ní íocaim as an "toll" ar an M50
Agus rachaidh muid ar aghaidh go dtí go bhfuil gach deor críochnaithe
Raithneach dleathach in focan Éire aontaithe

[Idirlinn: Garda]
“Young man we caught you damaging public property
And you are coming to the station so we can talk properly”
[Mo Chara — Véarsa 6]
Tá tú ag labhairt le Kneecap is cuma linn sa tsioc
Bím ar Facebook do mháthair ag wankáil like foc
Ag streachailt do m’anáil mar tá do dheirfiúr fliuch
Ag tabhairt greadadh do d’athair agus mé lom nocht

Mar le tamall anois tá mé as mo mheabhair
Déanfaidh mise a bheag duit agus tú os comhair
Cébí, duine a bhí, mar chuid de do shaol
Brisim achan riail, seachas focan caol le caol

[Cúrfa]

C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

[Cúrfa]
C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada

C.E.A.R.T.A
Is cuma liom sa foc faoi aon gharda
Dúidín lasta, tá mise ró-ghasta
Ní fheicfidh tú mise i mo sheasamh ró-fhada



2
Embed
About
This song bio is unreviewed
Genius Annotation
1 contributor
Kneecap got the idea for C.E.A.R.T.A after móglaí bap was out spray painting with a friend and wrote “cearta” on a bus stop which means rights as gaeilge. The PSNI/RUC showed up and lifted his friend while móglaí escaped. This friend refused to speak english during the interrogation and was kept overnight at the station while they waited for a translator. The songs music video is a recreation of these events.

+10



Share
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
What did Kneecap say about "C.E.A.R.T.A"?

Genius Answer
1 contributor
Irish is my first language. There are a growing number of Irish speakers who like to party, smoke, have raves. A lot of my friends don’t vote Sinn Fein and they’re not republican. We’re proud of Sean-nos and Irish culture, but we don’t want to be defined by it. We wanted this song to break stereotypes. We’re not saying we agree with using RUC as a term for the PSNI, but it happens in Belfast.

– Móglaí Bap, via The Sunday Times

+12
Who produced “C.E.A.R.T.A” by Kneecap?

When did Kneecap release “C.E.A.R.T.A”?

Who wrote “C.E.A.R.T.A” by Kneecap?

3CAG (2018)
Kneecap
1.
Your All Legitimate Targets
2.
Amach Anocht
3.
Tá na Baggies ar an Talamh
4.
C.E.A.R.T.A
5.
Incognito
6.
Ceacht Mo Chara
7.
Your Sniffer Dogs Are Shite
8.
Bouncers
Expand 
Credits
Producer
Gunna Bango
Writers
Mo Chara & Móglaí Bap
Released on
December 15, 2017
Tags
Rap
UK
Northern Ireland
Gaeilge
Comments
Add a comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Investors with €500k or more, get our guide and ongoing insights to learn ways to grow your wealth from your portfolio.
(Fisher Investments Ireland)
Tim Curry: rare public appearance sparks concern among fansFROM THE WEB
Tim Curry: rare public appearance sparks concern among fans
(Ohmymag)
New revelation in Madeleine McCann case: Suspect's cellmate says, 'there was talk of a girl...'FROM THE WEB
New revelation in Madeleine McCann case: Suspect's cellmate says, 'there was talk of a girl...'
(NEWS/OhMyMag.co.uk)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
FROM THE WEB
11 Retirement Blunders to Avoid Once Your Portfolio Reaches €350,000
(Fisher Investments Ireland)
Play this game for 1 minute, if you have a mouseFROM THE WEB
Play this game for 1 minute, if you have a mouse
Play for free. No Installation.
(Combat Siege)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
Animals (Pt. I)
Free
HUNTR/X - Golden (Romanized)
What It Sounds Like
How It’s Done
View All
