{

  "id": "incognito",
  "title": "Incognito",
  "titleEnglish": "Incognito",
  "album": "3CAG",
  "year": "2019",
  "duration": "4:08",
  "primaryLanguage": "bilingual",
  "lines": [
    {
      "type": "section",
      "section": "Verse 1"
    },
    {
      "english": "'Gul síos ar an snaois, you're sniffing the coke",
      "irish": "'Gul síos ar an snaois, tá tú ag tabhairt boladh don chóicín"
    },
    {
      "english": "Tá tú ag iarraidh cúpla smailc, you're looking a wee smoke",
      "irish": "Tá tú ag iarraidh cúpla smailc, tá tú ag iarraidh toitín beag"
    },
    {
      "english": "Trí chonsan agus guta, that's Molly or MD",
      "irish": "Trí chonsan agus guta, sin Molly nó MDMA"
    },
    {
      "english": "\"An bhfuil cead agam eochair?\", if you fancy a key",
      "irish": "\"An bhfuil cead agam eochair?\" más mian leat bump beag"
    },
    {
      "english": "And if you can't grasp that, say Micí Dainín",
      "irish": "Agus mura dtuigeann tú sin, abair Micí Dainín"
    },
    {
      "english": "Or if he's mad for the coke, then he's a 'snaoisín'",
      "irish": "Má tá fonn an chóicín air, is snaoisín é"
    },
    {
      "english": "If you don't have a 'dom, then you have no coiscín",
      "irish": "Mura bhfuil dom agat, níl coiscín agat"
    },
    {
      "english": "Kneecap, gan stop, anois a bhuachaillí",
      "irish": "Kneecap, gan stopadh, anois a bhuachaillí"
    },

    {
      "english": "You say \"Foc me!\" when you see na Gardaí",
      "irish": "Deir tú 'Foc me!' nuair a fheiceann tú na Gardaí"
    },
    {
      "english": "'Nother one for the cops is \"Fuck the RUC!\"",
      "irish": "Eile le haghaidh na póilíní ná 'Fuck the RUC!'"
    },
    {
      "english": "As well as that we have na fir buí",
      "irish": "Agus leis sin tá na fir buí againn"
    },
    {
      "english": "Just connigh súil amach do na bastardí",
      "irish": "Coinnigh súil amach do na bastaird sin"
    },
    {
      "english": "So más maith leat an phit, you like a bit of gee",
      "irish": "Má thaitníonn an pit leat, is maith leat mná"
    },
    {
      "english": "Nó más fearr leat an bod, you like getting the D",
      "irish": "Nó más fearr leat an bod, is maith leat an D"
    },
    {
      "english": "Más maith leat green dul síos go teach Aoidh",
      "irish": "Más maith leat green (cannabas), téigh go teach Aoidh"
    },
    {
      "english": "Seo an 3CAG crew le focain ceacht inniu",
      "irish": "Seo foireann 3CAG le ceacht fucking inniu"
    },

    {
      "type": "section",
      "section": "Chorus"
    },
    {
      "english": "Céim a haon to being incognito: Las an dúid agus just foghlaim an lingo",
      "irish": "Step one to being incognito: Light up a joint and learn the lingo"
    },
    {
      "english": "Céim a dó for avoidin' the law: Caith do focain bally gach aon lá",
      "irish": "Step two to avoid the law: Wear your fucking balaclava every day"
    },
    {
      "english": "Is céim a trí, seo an ceann is tábhachtaí: Just ná focain éist le RTÉ",
      "irish": "And step three, the most important one: Just don’t fucking listen to RTÉ"
    },
    {
      "english": "Ná focain éist le RTÉ",
      "irish": "Don’t fucking listen to RTÉ"
    },

    {
      "type": "section",
      "section": "Verse 2"
    },
    {
      "english": "Tá na leaids ar fad clocháilte, we're stoned to the bone",
      "irish": "All the lads are stoned, clocháilte amach is amach"
    },
    {
      "english": "Tá tú ag iarraidh a bheith focáilte, cur snaois i do shrón",
      "irish": "You want to get fucked up, shove coke up your nose"
    },
    {
      "english": "'Fear glic' is a housebreaker up in Malone",
      "irish": "'Fear glic' is a burglar living in Malone"
    },
    {
      "english": "Ag goideadh airgid ó rich cunts and taking it home",
      "irish": "Stealing cash from rich cunts and taking it home"
    },
    {
      "english": "'Gan airgead' is skint, mar a bhíonn de ghnáth",
      "irish": "‘Gan airgead’ means broke, like usual"
    },
    {
      "english": "You can't pay for drugs so you get tic gach lá",
      "irish": "Can’t pay for drugs so you get tic (credit) every day"
    },
    {
      "english": "'Píonós pointí' is penalty points",
      "irish": "'Píonós pointí' means penalty points"
    },
    {
      "english": "The Stinging Roger is the drioblaín at the end of your joints",
      "irish": "The Stinging Roger is the butt of your joint"
    },
    {
      "english": "An phit is a gee, minge, fanny or a flirt",
      "irish": "'An phit' is slang for vagina"
    },
    {
      "english": "If you're fucked from last night, tá tinneas póit ort",
      "irish": "If you're wrecked from last night, you’ve got a hangover"
    },
    {
      "english": "What you need is a wee bit of faoiseamh béil",
      "irish": "What you need is a bit of oral relief"
    },
    {
      "english": "But steal her cac and cuir é suas i Shankill Buy and Sell",
      "irish": "Steal her crap and put it up on Shankill Buy and Sell"
    },

    {
      "type": "section",
      "section": "Verse 3"
    },
    {
      "english": "Incognito, just follow na rialacha",
      "irish": "Incognito, just follow the rules"
    },
    {
      "english": "Cur do dope i bhfolach 'is hide your paraphernalia",
      "irish": "Hide your dope and your paraphernalia"
    },
    {
      "english": "A brathadóir is a Tout, but sure they're always afraid of ya",
      "irish": "A brathadóir is a tout/snitch, but they’re always scared of you"
    },
    {
      "english": "And if you're fucking grannied then look at the fucking state of ya",
      "irish": "And if you're out of it (grannied), look at the state of ya"

    },

    {
      "type": "section",
      "section": "Verse 4 / Outro"
    },
    {
      "english": "When you see your mate, you say '’Dé an fucking craic?'",
      "irish": "When you see your mate, you say 'What's the fucking craic?'"
    },
    {
      "english": "Nó 'Cad é mar atá' if you wanna be polite",
      "irish": "Or 'Cad é mar atá tú?' if you want to be polite"
    },
    {
      "english": "You say 'Maith go leor!' if you think he's alright",
      "irish": "Say 'Maith go leor!' if he’s grand"
    },
    {
      "english": "Or if he's lán de cac that means he's full of shite",
      "irish": "If he's 'lán de cac' that means he's full of shite"
    },
    {
      "english": "A dúid mór ramhar is a busty joint",
      "irish": "A big fat joint is 'dúid mór ramhar'"
    },
    {
      "english": "And you always speak the lingo at a Garda checkpoint",
      "irish": "And always use the lingo when stopped by the Gardaí"
    },
    {
      "english": "Ach rud amhain eile sula ndéanaimid dearmad:",
      "irish": "But one more thing before we forget:"
    },
    {
      "english": "You say 'Na Sé Chontae' for the North of Ireland",
      "irish": "Say 'Na Sé Chontae' instead of Northern Ireland"
    },

    {
      "type": "section",
      "section": "Outro Chorus"
    },
    {
      "english": "Céim a haon to being incognito:\nLas an dúid agus just foghlaim an lingo",
      "irish": "Step one to being incognito:\nLight a joint and learn the slang"
    },
    {
      "english": "Céim a dó for avoidin' the law:\nCaith do focain bally gach aon lá",
      "irish": "Step two to avoid the law:\nWear your fucking balaclava every day"
    },
    {
      "english": "Is céim a trí, seo an ceann is tábhachtaí\nJust ná focain éist le RTÉ",
      "irish": "And step three, most important:\nJust don’t fucking listen to RTÉ"
    },
    {
      "english": "Right!\nAn bhfuil sibh ag focain éisteacht?",
      "irish": "Right!\nAre ye fucking listening?"
    }
  ]
}
