

Music IQ
Featured
Charts
Videos
Promote Your Music
Sign Up
Search lyrics & more

Cover art for Tá na Baggies ar an Talamh by Kneecap
Tá na Baggies ar an Talamh
Kneecap
Featuring
MC Muipeád
Track 3 on
3CAG 
Aug. 19, 2018
1 viewer
14.6K views




22 Contributors
Tá na Baggies ar an Talamh Lyrics
Tá na baggies ar an talamh
Tá na baggies ar an talamh
Tá na baggies ar an talamh
Tá na baggies ar an talamh

Ar ais inniu, ag socrú na baggies ar an talamh
Beidh siad lán le snaois gabh buíochas arís le Kneecap 'is iad a bhailiú
Ar an ghuthán le mo nascanna thiar i gConamara
Deir sé liom "Ná bí buartha, tá sé faoi smacht agam Mo Chara"
Couple o' pacáiste ar an bhealach
M16, fíon, nathair nimhe
Cóc ar an chaighdeán is airde a bhfaca tú riamh roimhe
Díreach as Bolivia go Baile Conaola
Cóir a bheadh chomh glan céanna le pit bean rialta
Ordaithe i Rath Chairn agus i Tír Eoghain
Focain next-day drugs achan áit ar an domhan

Ag obair like fuck agus ní stopann an guthán
Mar tá réaltaí TG4 flat-out ar an snaois bhán
Fiche ceathar uair, gach lá den tseachtain
"Haigh, cén chaoi bhfuil tú, mála beag ketamine?"
Seo dhuit do mhedicine, do mheitamfataimín
Molaimid é agus é bog deas mín
Díreach cúpla mí tagtha ar an scene
'Is tá Kneecap cheana féin ar cúpla céad míle screen
See Kneecap Live
Get tickets as low as $81

You might also like
Amach Anocht
Kneecap
C.E.A.R.T.A
Kneecap
Your Sniffer Dogs Are Shite
Kneecap
[Curfá]
Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile dhuine stroke a Sainsbury's trolley

Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile dhuine stroke a Sainsbury's trolley

Ach anois, tá an beart seo críochnaithe
Deich kilo eile ag teacht ó Bolivia
Smugailte trasna i mbád beag farraige
Ní fheicfidh tú faic ach buidéal beag Nivea

'Is níl muid buartha faoi aon focain Garda
Mar íocainn muid gach ceann thiar i gConamara
So isteach sa phone booth 's tá glaoch ag fanacht
"Yes Hector, cad é ar mhaith leat a cheannach?"

Ar an bhealach mór fada, ach tá muid beagnach ann
Cén fáth a mbeadh post agam, ta mise i mbun
'Is beidh an snaois ar fad ag teacht anois i gceann tamaillín
Ar dtús roinnt munchies a goideadh ón Applegreen
Srón lán, snaois bhán, bolg lán milseán
Cosúil leis na físeáin a bhfacthas sa nuacht
Couple o' mad cunts amach ag smuggláil sa nocht
Tá na gardaí íoctha so ná hoscail do bhéal
Nó beidh cuairteoir ag teacht ón Chonamara Cartel

[MC Muipéad]
Ón bpoitín geal suaimhneach, MD fuadrach
Raithneach glas agus na rudaí sin atá ró-dheas
Tá 's aigesan down ansin amach romhainn
Tuige nach mbeadh do chraic breá sin againn
Focáil leat a mhac bán tá sé seo faoi mo smachtsa
Is fada uaim an lá ag socrú é seo
Ní dhéanaim ach plé le laochanna Gaelacha
Na leaids Kneecap as iarthar Bhéal Feirste
(focain kneecaps)

[Curfá]
Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile dhuine stroke a Sainsbury's trolley

Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile dhuine stroke a Sainsbury's trolley
Pacáilte anois tá muid ag dul ar an bhóthar
Maith thú a mhac, 'is abair "haigh" le do mháthair
'nois céad stop eile HQ TG4
Mar tá sneachta geallta 's níl mé ag caint ar an aimsir

Ach stop amháin eile sula dtéann muid abhaile
Cúpla kilo snaois do na leaids thíos i Dáil Éire(ann)
Ar fud na háite, ar gach uile bhaile
Ó iarthar Chonamara go focain Guatemala

[Curfá]
Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile duine stroke a Sainsbury's trolley

Ins an aifreann (tá na baggies ar an talamh)
Nó ag fáil prescription (tá na baggies ar an talamh)
Lemon haze, snaois bhán, blues agus molly
Gach uile duine stroke a Sainsbury's trolley

Tá na baggies ar an talamh (stroke a Sainsbury's trolley)
Tá na baggies ar an talamh (stroke a Sainsbury's trolley)
Tá na baggies ar an talamh (the pussy's on the floor)
Tá na baggies ar an talamh



Embed
About
Have the inside scoop on this song?
Sign up and drop some knowledge
Start the song bio
Q&A
Find answers to frequently asked questions about the song and explore its deeper meaning

Ask a question
When did Kneecap release “Tá na Baggies ar an Talamh”?

Who wrote “Tá na Baggies ar an Talamh” by Kneecap?

3CAG (2018)
Kneecap
1.
Your All Legitimate Targets
2.
Amach Anocht
3.
Tá na Baggies ar an Talamh
4.
C.E.A.R.T.A
5.
Incognito
6.
Ceacht Mo Chara
7.
Your Sniffer Dogs Are Shite
8.
Bouncers
Credits
Featuring
MC Muipeád
Writers
Móglaí Bap, Mo Chara & MC Muipeád
Released on
August 19, 2018
Tags
Rap
UK
Northern Ireland
Gaeilge
Comments
Add a comment
Get the conversation started
Be the first to comment
Sign Up And Drop Knowledge 🤓
Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love.
Sign Up
FROM THE WEB
When Will You Be Able to Retire?
(Fisher Investments Ireland)
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fallFROM THE WEB
Liam Payne's ex-girlfriend revealed 'he would always play with death' days before tragic fall
(Ohmymag)
Man falls to his death in work accident - it was confirmed to be a Gogglebox starFROM THE WEB
Man falls to his death in work accident - it was confirmed to be a Gogglebox star
(NEWS/OhMyMag.co.uk)
At What Age Can You Retire With €500,000?FROM THE WEB
At What Age Can You Retire With €500,000?
Get your copy of the guide and ongoing insights to learn ways to grow your wealth and generate income from your portfolio.
(Fisher Investments Ireland)
Tim Curry: rare public appearance sparks concern among fansFROM THE WEB
Tim Curry: rare public appearance sparks concern among fans
(Ohmymag)
Do you have a mouse? Play this game for 1 minuteFROM THE WEB
Do you have a mouse? Play this game for 1 minute
Play for free. No Installation.
(Combat Siege)

Genius is the world’s biggest collection of song lyrics and musical knowledge
About Genius
Contributor Guidelines
Press
Shop
Advertise
Privacy Policy
Privacy Preferences
Licensing
Jobs
Developers
Copyright Policy
Contact Us
Sign In
Do Not Sell My Personal Information
© 2025 ML Genius Holdings, LLC
Terms of Use
Verified Artists
All Artists:
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
#
Hot Songs:
Free
Animals (Pt. I)
HUNTR/X - Golden (Romanized)
What It Sounds Like
How It’s Done
View All
