{
    "id": "sniffer-dogs-are-shite",
    "title": "Your Sniffer Dogs Are Shite",
    "titleEnglish": "Your Sniffer Dogs Are Shite",
    "album": "3CAG",
    "year": "2019",
    "duration": "3:10",
    "primaryLanguage": "bilingual",
    "lines": [
      {
        "type": "section",
        "section": "Intro/Hook"
      },
      {
        "irish": "Tinn, bréan tinn na undercover cops again",
        "english": "Sick, absolutely sick of the undercover cops again"
      },
      {
        "irish": "Tinn, bréan tinn na undercover cops again",
        "english": "Sick, absolutely sick of the undercover cops again"
      },
      {
        "irish": "Tinn, bréan tinn na undercover cops again",
        "english": "Sick, absolutely sick of the undercover cops again"
      },
  
      {
        "type": "section",
        "section": "Verse 1"
      },
      {
        "english": "'G 'ul tríd mo phócaí agus stocaí mar a rin' siad cheanna féin",
        "irish": "Going through my pockets and socks like they already did before"
      },
      {
        "english": "\"Bain díot do chaipín agus tóg as do chain",
        "irish": "\"Take off your cap and empty your pockets"
      },
      {
        "english": "Let me see your ID and empty out your change",
        "irish": "Taispeáin dom do ID agus folmhaigh do mhalartán"
      },
      {
        "english": "An bhfuil aon rud mídhleathach ort? I won't say it again",
        "irish": "Do you have anything illegal on you? Ní déarfaidh mé arís é"
      },
      {
        "english": "Má fhaighimid rud éigin, there's things that you'll have to explain.\"",
        "irish": "If we find something, beidh ort roinnt rudaí a mhíniú."
      },
  
      {
        "english": "\"Tá aithne súil agam ort, cé ' dúirt bhfuil muid roimhe",
        "irish": "\"I recognise you, didn’t we meet before?"
      },
      {
        "english": "Bhí tusa sa pháirc, sé déag, ag díolú malaí luibheanna",
        "irish": "You were in the park, sixteen, selling bags of weed"
      },
      {
        "english": "In fact domh d'ainm anois, agus d'uimhir",
        "irish": "In fact give me your name now, and your number"
      },
      {
        "english": "Scumbags like you make my balls shiver\"",
        "irish": "Scumbags cosúil leatsa cuireann mo liathróidí ag crith"
      },
  
      {
        "english": "You can call me 'Mo Chara', a local celeb i gConamara",
        "irish": "Glaoigh orm 'Mo Chara', réalta áitiúil i gConamara"
      },
      {
        "english": "\"I haven't been a scumbag in years Mr Garda",
        "irish": "\"Níl mé i mo scumbag le blianta, a Gharda"
      },
      {
        "english": "I just wanna have a few beer Mr Garda",
        "irish": "Níl uaim ach cúpla beoir, a Gharda"
      },
      {
        "english": "And I swear I haven't got any gear Mr Garda\"",
        "irish": "Agus geallaim nach bhfuil aon drugaí agam, a Gharda\""
      },
  
      {
        "english": "Isteach liom, amadán, tá mo fobhríste lán",
        "irish": "I walk in, eejit — my boxers are full"
      },
      {
        "english": "Do pills, half-grams, dodgy-looking snaois bhán",
        "irish": "Of pills, half grams, dodgy-looking white sniff"
      },
      {
        "english": "Fuckin' ar bís man, fuck the police man",
        "irish": "Feckin’ buzzing man, feck the police man"
      },
      {
        "english": "Mo chara's shoving gear díreach os do ghaosán",
        "irish": "Mo Chara's shoving gear straight under your nose"
      },
  
      {
        "type": "section",
        "section": "Hook / Refrain"
      },
      {
        "english": "Your sniffer dogs are shite",
        "irish": "Tá do mhadraí sniffála ina raic"
      },
      {
        "english": "Mate, your sniffer dogs are shite",
        "irish": "A chara, tá do mhadraí sniffála ina raic"
      },
  
      {
        "type": "section",
        "section": "Verse 2"
      },
      {
        "english": "Siúil isteach, 3CAG i mo cacht",
        "irish": "Walk in, 3CAG in my stash"
      },
      {
        "english": "Mála raithní, buidéal Bucks",
        "irish": "Bag of fern, bottle of Buckfast"
      },
      {
        "english": "Skin mór ramhar, just relax",
        "irish": "Big fat skin (joint), just relax"
      },
      {
        "english": "Seo mar atá sé, just the facts",
        "irish": "That’s how it is, sin na fíricí"
      },
      {
        "english": "Daoine óga le contacts, twenny inches when erect",
        "irish": "Young lads with contacts, twenty inches when hard"
      },
      {
        "english": "Yes, we want our country back, ach fuckin coinnigh Paddy Jack",
        "irish": "Sea, ba mhaith linn ár dtír ar ais — ach coinnigh Paddy Jack"
      },
      {
        "english": "Yes tá allas ar mo bhos, 's ní bhíomsa i mo thost",
        "irish": "Sea, tá allas ar mo lámh, and I won’t stay quiet"
      },
      {
        "english": "'s ní ghlacaim fuckin' sos, always kickin' up a fuss",
        "irish": "And I don’t take a fuckin’ break — always causing a stir"
      },
      {
        "english": "Ag na féiltí is a must, Nike Air Max agus Berghaus",
        "irish": "At the festivals it’s a must — Nike Air Max and Berghaus"
      },
      {
        "english": "Seven carat chain Argos, agus upper-cuttin' guffs",
        "irish": "Seven carat chain from Argos, uppercutting eejits"
      },
  
      {
        "type": "section",
        "section": "Verse 3"
      },
      {
        "english": "‘Nois, ‘chóir a bheith istigh de na geataí, ach amhain some cunts acting na crá chroí",
        "irish": "Now, we should be past the gates, but some eejits causing grief"
      },
      {
        "english": "Asking for my ID and if I wanna be locked up in Maghaberry",
        "irish": "Ag iarraidh mo ID agus ceistíonn siad an bhfuil mé ag iarraidh dul go Maghaberry"
      },
      {
        "english": "S' dúirt mé \"nah, tá mé maith go leor\"",
        "irish": "Dúirt mé, “nah, I’m grand”"
      },
      {
        "english": "Scian sa bholg and he hit the floor",
        "irish": "Knife in the belly and he dropped to the floor"
      },
      {
        "english": "Agus ceann amhain eile agus cinnte deor",
        "irish": "And another one too, and definite tears"
      },
      {
        "english": "Ansin go leor, do you want some more?",
        "irish": "That’s enough, or do you want more?"
      },
      {
        "english": "'Nois díreach in aice liom, tá an madadh ag tafann",
        "irish": "Now right beside me, the dog is barking"
      },
      {
        "english": "\"This is the part where you stop laughing\"",
        "irish": "\"Seo an áit ina stadann tú ag gáire\""
      },
      {
        "english": "Scian isteach le giota beag tafainn",
        "irish": "Knife in with a small stab"
      },
      {
        "english": "No more madadh, no more sniffin'",
        "irish": "Níl aon mhadadh eile, níl sniffáil ar bith"
      },
  
      {
        "type": "section",
        "section": "Verse 4"
      },
      {
        "english": "Níos mó daoine óga ag cuir gear ina mbróga",
        "irish": "More young ones hiding gear in their shoes"
      },
      {
        "english": "\"'Bhfuil stuff agat? Tá leoga\"",
        "irish": "\"Got any stuff? For sure\""
      },
      {
        "english": "Get wined out and do some yoga",
        "irish": "Ól fíon go leor agus déan beagán yoga"
      },
      {
        "english": "Ar dtús faigh partner a phógfá, tá mise ag fáil ró thógtha",
        "irish": "First get a partner you’d kiss — I’m getting too worked up"
      },
      {
        "english": "Could lend a score from m'athair cróga",
        "irish": "Could borrow €20 from my brave oul’ fella"
      },
      {
        "english": "But I'll leave him with it for a joint in Avoca",
        "irish": "But I’ll leave him with it and roll a joint in Avoca"
      },
  
      {
        "type": "section",
        "section": "Verse 5"
      },
      {
        "english": "Kneecap — Seo mar a bhíonn muid i gcomparáid",
        "irish": "Kneecap — this is how we compare"
      },
      {
        "english": "Kneecap — Always heard screaming \"up the ra\"",
        "irish": "Kneecap — cloistear i gcónaí ag screadach \"up the ra\""
      },
      {
        "english": "Kneecap — Known to be head over heels i ngrá",
        "irish": "Kneecap — cáiliúil mar atá i ngrá go craiceáilte"
      },
      {
        "english": "Le drugaí linguistics agus mo ma",
        "irish": "With drugs, linguistics, and my mam"
      },
      {
        "english": "Seo thug logistics, seo mar atá",
        "irish": "This brought logistics — this is how it is"
      },
      {
        "english": "Double-dipping biscuits i mo chupán",
        "irish": "Double-dipping biscuits in my cup"
      },
      {
        "english": "Sin ag ithe picnic ag suí faoi crann",
        "irish": "That’s having a picnic sitting under a tree"
      },
      {
        "english": "Whilst getting frisky le Cumann na mBan",
        "irish": "Agus ag dul craiceáilte le Cumann na mBan"
      },
  
      {
        "type": "section",
        "section": "Outro"
      },
      {
        "english": "Cá bhfuil an snaois? Leaid, cá bhfuil an snaois?",
        "irish": "Where's the sniff? Lads, where's the sniff?"
      },
      {
        "english": "Táim ag teacht aníos leaid, cá bhfuil an snaois?",
        "irish": "I'm coming up, lads, where’s the sniff?"
      },
      {
        "english": "All jokin' aside lads, cá bhfuil an fucking snaois?",
        "irish": "All joking aside lads — where’s the fucking sniff?"
      }
    ]
  }
  